/*
 * 练习题2.1
 * A: 将 0x8F7A93 转换为二进制
 * B: 将二进制 1011011110011100 转换为十六进制
 * C: 将0xC4E5D 转换为二进制
 * D: 将二进制 1101011011011111100110 转换为十六进制
 *
 * 十进制:    0    1    2    3    4    5    6    7    8    9    10    11    12    13    14    15
 * 二进制:   0000 0001 0010 0011 0100 0101 0110 0111 1000 1001 1010  1011  1100  1101  1110  1111
 * 十六进制:  0    1    2    3    4    5    6    7    8    9    A     B     C     D     E     F
 *
 */

#include <stdio.h>

int main()
{
    printf("0x8F7A93 对应的二进制为: %s\n", "100011110111101010010011");
    printf("1011011110011100 转换十六进制为: %s\n", "0xB79C");
    printf("0xC4E5D 对应的二进制为: %s\n", "11000100111001011100");
    printf("1101011011011111100110 转换成十六进制: %s\n", "0x35B7E6");

    return 0;
}
